In [164]:
#Exercise
#1.how many row and column on data
print(imdb_update.shape)

(3781, 36)

In [168]:
#2. top 3 movies with highest nett profit 2013
imdb_update[imdb_update.title_year == 2013].sort_values(by=['net_USD'], ascending=False).head(3)

,movie_ID,movie_title,duration,color,title_year,country,language,content_rating,budget_USD,gross_USD,...,actor_3_facebook?,actor_3_facebook_likes,cast_total_facebook_likes,movie_facebook?,movie_facebook_likes;,facenumber_in_poster,num_voted_users,num_user_for_reviews,imdb_score,imdb_top_250
1614,1615,The Hunger Games: Catching Fire,146,1,2013,USA,English,PG-13,130000000,424645577,...,1,523,49355,1,82000,1,498397,706,7.6,0
236,237,Despicable Me 2,98,1,2013,USA,English,PG,76000000,368049635,...,1,1000,11905,1,56000,0,286877,284,7.5,0
57,58,Frozen,102,1,2013,USA,English,PG,150000000,400736600,...,1,490,2582,1,58000,0,421658,904,7.6,0

In [176]:
#3. top 3 movies with highest gross in 2009
imdb_update[imdb_update.title_year == 2009].sort_values(by=['gross_USD'], ascending=False).head(3)

,movie_ID,movie_title,duration,color,title_year,country,language,content_rating,budget_USD,gross_USD,...,actor_3_facebook?,actor_3_facebook_likes,cast_total_facebook_likes,movie_facebook?,movie_facebook_likes;,facenumber_in_poster,num_voted_users,num_user_for_reviews,imdb_score,imdb_top_250
0,1,Avatar,178,1,2009,USA,English,PG-13,237000000,760505847,...,1,855,4834,1,33000,0,886204,3054,7.9,0
19,20,Transformers: Revenge of the Fallen,150,1,2009,USA,English,PG-13,200000000,402076689,...,1,464,3218,0,0,0,323207,1439,6.0,0
3094,3095,Harry Potter and the Half-Blood Prince,153,1,2009,UK,English,PG,250000000,301956980,...,1,10000,58753,1,10000,3,321795,973,7.5,0

In [185]:
#4. how many NON english movies
len(imdb_update[imdb_update.language != 'English']['language'])

153

In [187]:
#5. top 3 languages in data aside english (based on number movies)
imdb_update[imdb_update.language != 'English']['language'].value_counts().head(3)

French      33
Spanish     23
Mandarin    14
Name: language, dtype: int64

In [195]:
#6. Top 3 countries with highest nett profit in all dataset times
imdb_update[['country','net_USD']].groupby('country').net_USD.sum().sort_values(ascending=False).head(3) 
#groupby = Group by di sql

country
USA          52003933174
UK            1531614524
Australia      252571616
Name: net_USD, dtype: int64

In [196]:
#7. average budget of all movies in dataset 2013
imdb_update[imdb_update.title_year == 2013][["budget_USD"]].mean()

budget_USD    5.106961e+07
dtype: float64

In [197]:
#8. average budget of all movies in dataset 2014
imdb_update[imdb_update.title_year == 2014][["budget_USD"]].mean()

budget_USD    4.991901e+07
dtype: float64

In [198]:
#9. which one is higher between no 7 and 8
#2013

In [228]:
#10. What movie that resulted highest nett profit of all dataset times? How much did the movie make?
imdb_update[['movie_title','net_USD']].sort_values(by=['net_USD'], ascending=False).head(1)

  movie_title    net_USD
0      Avatar  523505847